SolutionApps/App.Solutions/App.WebAPIConfigService/App_Data/ApiLogFiles/UserLogFiles/GK1WE8E7XB/EnhancedBookMultiSegmentRQ.log

<?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader"><soapenv:Header>  <eb:MessageHeader soapenv:mustUnderstand="1" eb:version="1.0">       <eb:From>           <eb:PartyId eb:type="urn: x12.org:IO5: 01">999999</eb:PartyId>       </eb:From>       <eb:To>           <eb:PartyId type="urn:x12.org:IO5:01">123123</eb:PartyId>       </eb:To>       <eb:CPAId>3RT2</eb:CPAId>       <eb:ConversationId>1111111111111111111</eb:ConversationId>       <eb:Service eb:type="sabreXML">EnhancedAirBookRQ</eb:Service>       <eb:Action>EnhancedAirBookRQ</eb:Action>       <eb:MessageData>           <eb:MessageId>mid:0_2014-09-22T21:43:40m</eb:MessageId>           <eb:Timestamp>2014-09-22T21:43:40</eb:Timestamp>           <eb:TimeToLive>2014-09-22T21:43:40</eb:TimeToLive>       </eb:MessageData>       <eb:DuplicateElimination/>       <eb:Description>Air Book Service</eb:Description>   </eb:MessageHeader>   <sec:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">       <sec:BinarySecurityToken>Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/RESD!ICESMSLB\/RES.LB!1546236789047!5229!41</sec:BinarySecurityToken>   </sec:Security></soapenv:Header><soapenv:Body>    <EnhancedAirBookRQ  xmlns="http://services.sabre.com/sp/eab/v3_6"  version="3.6.0" IgnoreOnError="true" HaltOnError="false" >     <OTA_AirBookRQ>   <RetryRebook Option="true"/>   <HaltOnStatus Code="NO"/>   <HaltOnStatus Code="NN"/>   <HaltOnStatus Code="UC"/>   <HaltOnStatus Code="US"/>   <HaltOnStatus Code="WL"/>   <HaltOnStatus Code="HL"/>   <HaltOnStatus Code="UN"/>   <HaltOnStatus Code="PN"/>   <HaltOnStatus Code="LL"/>      <OriginDestinationInformation>   <FlightSegment DepartureDateTime="2019-03-06T18:00" ArrivalDateTime="2019-03-06T19:15" FlightNumber="477" NumberInParty="1" ResBookDesigCode="Y" Status="NN">      <DestinationLocation   LocationCode="YUL"/>      <Equipment AirEquipType="73H"/>      <MarketingAirline Code="TS" FlightNumber="477"/>      <OperatingAirline Code="TS"/>      <OriginLocation   LocationCode="YYZ"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2019-03-06T20:50" ArrivalDateTime="2019-03-07T09:40" FlightNumber="110" NumberInParty="1" ResBookDesigCode="U" Status="NN">      <DestinationLocation   LocationCode="CDG"/>      <Equipment AirEquipType="332"/>      <MarketingAirline Code="TS" FlightNumber="110"/>      <OperatingAirline Code="TS"/>      <OriginLocation   LocationCode="YUL"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2019-03-28T12:15" ArrivalDateTime="2019-03-28T15:10" FlightNumber="111" NumberInParty="1" ResBookDesigCode="O" Status="NN">      <DestinationLocation   LocationCode="YUL"/>      <Equipment AirEquipType="332"/>      <MarketingAirline Code="TS" FlightNumber="111"/>      <OperatingAirline Code="TS"/>      <OriginLocation   LocationCode="CDG"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2019-03-28T18:40" ArrivalDateTime="2019-03-28T19:55" FlightNumber="450" NumberInParty="1" ResBookDesigCode="Y" Status="NN">      <DestinationLocation   LocationCode="YYZ"/>      <Equipment AirEquipType="73H"/>      <MarketingAirline Code="TS" FlightNumber="450"/>      <OperatingAirline Code="TS"/>      <OriginLocation   LocationCode="YUL"/>     </FlightSegment>      </OriginDestinationInformation>     <RedisplayReservation NumAttempts="2" WaitInterval="5000"/>     </OTA_AirBookRQ> <PostProcessing IgnoreAfter ="false">   <RedisplayReservation WaitInterval ="5000"/> </PostProcessing>    </EnhancedAirBookRQ>   </soapenv:Body></soapenv:Envelope>